app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 ORDER BY "posts"."created_at" DESC LIMIT $2  [["id", 1080], ["LIMIT", 1]]
---
    def show
        @post = Post.find(params[:id])